#Вложенные циклы, линейные алгоритмы 24.12

# 1
"""
for x in range(15):
    n1 = 1*15**5 + 2*15**4 + 3*15**3 + x*15**2 + 5*15 + 1
    n2 = 1*15**4 + x*15**3 + 2*15**2 + 3*15 + 3
    if (n1 + n2) % 14 == 0:
        print((n1 + n2) // 14)
        break

# 3

for x in range(10):
    n1 = x*17**4 + 11*17**3 + 9*17 + 1
    n2 = x*15**3 + 8*15**2 + 14*15 + 8
    if (n1 + n2) % 155 == 0:
        print((n1 + n2) // 155)
        break

# 4

mn = 10**9
ans = 0
for x in range(11):
    for y in range(8):
        n1 = y*11**5 + 4*11**3 + x*11**2 + 5*11 + 1
        n2 = 2*8**5 + 5*8**4 + 3*8**3 + x*8**2 + y*8
        r = n1 + n2
        if r % 117 == 0 and r < mn:
            mn = r
            ans = r // 117
print(ans)
"""
